app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]
---
  def create
  # add create method here
  # create a new post, save it to the db
  # redirect to the new resource's show page
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.save